In [1]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_csv('datasets/restaurant_dataset_100_with_calories.csv')
df

,restaurant,country,city,dish,price_usd,servings,description,calories
0,Brazilian Grill #1,Brazil,São Paulo,Feijoada,20.45,261,"Stew of beans with pork, beef, and sausage, se...",816
1,Persian Delight #2,Iran,Tehran,Chelo Kebab,12.90,341,"Grilled kebabs served with saffron rice, butte...",341
2,Brazilian Grill #3,Brazil,São Paulo,Feijoada,21.91,213,"Stew of beans with pork, beef, and sausage, se...",702
3,Sushi Zen #4,Japan,Tokyo,Sushi Platter,24.94,394,"Assorted fresh sushi with tuna, salmon, shrimp...",877
4,Burger Hub #5,USA,New York,Cheeseburger,13.24,145,"Juicy beef patty with cheese, lettuce, tomato,...",1126
...,...,...,...,...,...,...,...,...
95,Seoul Kitchen #96,South Korea,Seoul,Bibimbap,15.21,121,"Mixed rice with vegetables, beef, egg, and chi...",1047
96,Russian Table #97,Russia,Moscow,Beef Stroganoff,17.88,314,Sautéed beef in creamy sauce with mushrooms an...,484
97,El Asador #98,Argentina,Buenos Aires,Bife de Chorizo,18.86,337,Grilled sirloin steak served with chimichurri ...,845
98,Thai Orchid #99,Thailand,Bangkok,Pad Thai,15.22,259,"Stir-fried rice noodles with shrimp, peanuts, ...",905
99,Casa de Tapas #100,Spain,Barcelona,Paella,28.77,332,"Traditional rice dish with seafood, chicken, a...",333

In [5]:
df.head()

,restaurant,country,city,dish,price_usd,servings,description,calories
0,Brazilian Grill #1,Brazil,São Paulo,Feijoada,20.45,261,"Stew of beans with pork, beef, and sausage, se...",816
1,Persian Delight #2,Iran,Tehran,Chelo Kebab,12.90,341,"Grilled kebabs served with saffron rice, butte...",341
2,Brazilian Grill #3,Brazil,São Paulo,Feijoada,21.91,213,"Stew of beans with pork, beef, and sausage, se...",702
3,Sushi Zen #4,Japan,Tokyo,Sushi Platter,24.94,394,"Assorted fresh sushi with tuna, salmon, shrimp...",877
4,Burger Hub #5,USA,New York,Cheeseburger,13.24,145,"Juicy beef patty with cheese, lettuce, tomato,...",1126

In [6]:
df.tail()

,restaurant,country,city,dish,price_usd,servings,description,calories
95,Seoul Kitchen #96,South Korea,Seoul,Bibimbap,15.21,121,"Mixed rice with vegetables, beef, egg, and chi...",1047
96,Russian Table #97,Russia,Moscow,Beef Stroganoff,17.88,314,Sautéed beef in creamy sauce with mushrooms an...,484
97,El Asador #98,Argentina,Buenos Aires,Bife de Chorizo,18.86,337,Grilled sirloin steak served with chimichurri ...,845
98,Thai Orchid #99,Thailand,Bangkok,Pad Thai,15.22,259,"Stir-fried rice noodles with shrimp, peanuts, ...",905
99,Casa de Tapas #100,Spain,Barcelona,Paella,28.77,332,"Traditional rice dish with seafood, chicken, a...",333

In [11]:
print(df.shape)

(100, 8)

In [9]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   restaurant   100 non-null    object
 1   country      100 non-null    object
 2   city         100 non-null    object
 3   dish         100 non-null    object
 4   price_usd    100 non-null    float64
 5   servings     100 non-null    int64
 6   description  100 non-null    object
 7   calories     100 non-null    int64
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB
None

In [12]:
print(df.describe())

        price_usd    servings     calories
count  100.000000  100.000000   100.000000
mean    17.492200  243.090000   729.470000
std      5.686034   94.540045   271.134037
min      6.870000   81.000000   279.000000
25%     14.042500  150.250000   517.000000
50%     16.100000  260.000000   710.500000
75%     20.210000  320.750000   988.750000
max     34.790000  397.000000  1179.000000

In [13]:
print(df['restaurant'])

0     Brazilian Grill #1
1     Persian Delight #2
2     Brazilian Grill #3
3           Sushi Zen #4
4          Burger Hub #5
             ...
95     Seoul Kitchen #96
96     Russian Table #97
97         El Asador #98
98       Thai Orchid #99
99    Casa de Tapas #100
Name: restaurant, Length: 100, dtype: object

In [14]:
df['dish'].head(10)

0                Feijoada
1             Chelo Kebab
2                Feijoada
3           Sushi Platter
4            Cheeseburger
5    Chicken Tikka Masala
6          Fish and Chips
7    Chicken Tikka Masala
8                Feijoada
9         Bife de Chorizo
Name: dish, dtype: object

In [15]:
df.columns

Index(['restaurant', 'country', 'city', 'dish', 'price_usd', 'servings',
       'description', 'calories'],
      dtype='object')

In [17]:
df[['country','dish']].head(10)

     country                  dish
0     Brazil              Feijoada
1       Iran           Chelo Kebab
2     Brazil              Feijoada
3      Japan         Sushi Platter
4        USA          Cheeseburger
5      India  Chicken Tikka Masala
6         UK        Fish and Chips
7      India  Chicken Tikka Masala
8     Brazil              Feijoada
9  Argentina       Bife de Chorizo

In [24]:
df['country'].unique()

array(['Brazil', 'Iran', 'Japan', 'USA', 'India', 'UK', 'Argentina',
       'South Korea', 'Spain', 'France', 'Turkey', 'Thailand', 'Germany',
       'Russia', 'Greece', 'China', 'Morocco', 'Lebanon', 'Italy'],
      dtype=object)

In [25]:
df['price_usd'].max()

np.float64(34.79)

In [26]:
df['restaurant'].nunique()

100

In [30]:
df_small=df[['restaurant', 'country', 'city', 'dish', 'price_usd']].head(10)
df_small

,restaurant,country,city,dish,price_usd
0,Brazilian Grill #1,Brazil,São Paulo,Feijoada,20.45
1,Persian Delight #2,Iran,Tehran,Chelo Kebab,12.90
2,Brazilian Grill #3,Brazil,São Paulo,Feijoada,21.91
3,Sushi Zen #4,Japan,Tokyo,Sushi Platter,24.94
4,Burger Hub #5,USA,New York,Cheeseburger,13.24
5,Tandoori Palace #6,India,Delhi,Chicken Tikka Masala,15.82
6,London Pub #7,UK,London,Fish and Chips,13.17
7,Tandoori Palace #8,India,Delhi,Chicken Tikka Masala,13.76
8,Brazilian Grill #9,Brazil,São Paulo,Feijoada,20.11
9,El Asador #10,Argentina,Buenos Aires,Bife de Chorizo,23.29

In [31]:
df_small['price_usd'].mean()

np.float64(17.959)

In [33]:
df['servings'].idxmax()

83

In [34]:
df.loc[df['servings'].idxmax()]

restaurant                                        Le Gourmet #84
country                                                   France
city                                                       Paris
dish                                                  Coq au Vin
price_usd                                                  20.13
servings                                                     397
description    Classic French dish of chicken braised with wi...
calories                                                     604
Name: 83, dtype: object

In [38]:
df.loc[df['servings'].idxmax()]['restaurant']

'Le Gourmet #84'

In [44]:
s = df['price_usd']
s

0     20.45
1     12.90
2     21.91
3     24.94
4     13.24
      ...
95    15.21
96    17.88
97    18.86
98    15.22
99    28.77
Name: price_usd, Length: 100, dtype: float64

In [40]:
type(s)

pandas.core.series.Series

In [45]:
d = df[['price_usd','servings']]
d

    price_usd  servings
0       20.45       261
1       12.90       341
2       21.91       213
3       24.94       394
4       13.24       145
..        ...       ...
95      15.21       121
96      17.88       314
97      18.86       337
98      15.22       259
99      28.77       332

[100 rows x 2 columns]

In [46]:
type(d)

pandas.core.frame.DataFrame

In [47]:
s.mean()

np.float64(17.4922)

In [48]:
d.mean()

price_usd     17.4922
servings     243.0900
dtype: float64

In [49]:
df['servings'].iloc[0]

np.int64(261)

In [51]:
df[['servings','country']].iloc[0]

servings       261
country     Brazil
Name: 0, dtype: object

In [52]:
type(df['servings'].iloc[0])

numpy.int64

In [53]:
type(df[['servings','country']].iloc[0])

pandas.core.series.Series